# identity-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/identity/shared/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-identity/runs/run-PPGrZmNSXAjUnZwD

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.database.cockroach_database.default: Refreshing state... [id=fd87de08-4d67-4311-9eaa-35b065cf7521:production-identity]
module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=fd87de08-4d67-4311-9eaa-35b065cf7521:production-identity-database-migration]
module.database.cockroach_database.default: Drift detected (delete)
module.database_migration_user.cockroach_sql_user.default: Drift detected (delete)
╷
│ Warning: Cluster not found
│
│   with module.database.cockroach_database.default,
│   on ../../../../../shared/infrastructure/modules/serverless_database/resources.tf line 5, in resource "cockroach_database" "default":
│    5: resource "cockroach_database" "default" {
│
│ Database's parent cluster with clusterID
│ fd87de08-4d67-4311-9eaa-35b065cf7521 is not found. Removing from state.
╵
╷
│ Warning: Cluster not found
│
│   with module.database_migration_user.cockroach_sql_user.default,
│   on ../../../../../shared/infrastructure/modules/serverless_database_user/resources.tf line 14, in resource "cockroach_sql_user" "default":
│   14: resource "cockroach_sql_user" "default" {
│
│ SQL User's parent cluster with clusterID
│ fd87de08-4d67-4311-9eaa-35b065cf7521 is not found. Removing from state.
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.database.cockroach_database.default has been deleted
  - resource "cockroach_database" "default" {
      - id         = "fd87de08-4d67-4311-9eaa-35b065cf7521:production-identity" -> null
      - name       = "production-identity" -> null
        # (1 unchanged attribute hidden)
    }

  # module.database_migration_user.cockroach_sql_user.default has been deleted
  - resource "cockroach_sql_user" "default" {
        id         = "fd87de08-4d67-4311-9eaa-35b065cf7521:production-identity-database-migration"
      - name       = "production-identity-database-migration" -> null
      - password   = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.database.cockroach_database.default will be created
  + resource "cockroach_database" "default" {
      + cluster_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "production-identity"
      + table_count = (known after apply)
    }

  # module.database_migration_user.data.aws_ssm_parameter.cluster_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "cluster_id" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "production-cockroachdb-serverless-cluster-id"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-identity-database-migration"
    }

  # module.database_migration_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "production-identity-database-migration"
      + password   = (sensitive value)
    }

  # module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "724071d6-0e19-40a3-807c-c8c530867738" -> "b9cb5666-ec65-46c9-a454-3e0d974feb08"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*